УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартКонечнаяДатаРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартДатаПродленияРезервов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартРезервЗаканчивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="025cec6b-a37b-4836-802d-b862a2c24680">
    <name>смартВидТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb1bda59-7ed7-46ee-9737-0e55e9b9f6e6">
    <name>смартНомерМашины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2b9ec282-ad92-44cb-b072-47a36f857325">
    <name>смартНомерПрицепа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1471b7a-c73b-41fd-afa0-58788430b04b">
    <name>смартФИОВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33b186f2-2628-48f3-a24e-adfce58bd35d">
    <name>смартНомерСерияПаспортВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3e9aa296-d524-418d-84ab-e9bea83d77eb">
    <name>смартДатаВыдачиПаспортаВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2f61b178-446c-49e4-b3cd-cf9f1c061abf">
    <name>смартЖелаемаяДатаОтгрузкиАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="671c355b-5223-4837-980b-5f9cd7f8cc7d">
    <name>смартЖелаемоеВремяОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fbce0c46-a4a3-49a3-aca2-e423debd297a">
    <name>смартФИОВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e99f34bd-4d77-4c27-a9bd-de06fcacc876">
    <name>смартНомерСерияПаспортВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7ac5896-d91d-4ee4-93dc-84fb50a8fe9f">
    <name>смартДатаВыдачиПаспортаВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НачалоОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаПеремещение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработкамиСмарт	

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Основание") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
			Тогда
			
			ЗаполнитьПоПриобретениюТоваров(ДанныеЗаполнения);
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Неверные параметры создания документа на основании'");
		КонецЕсли;
		
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения.Основание));
		Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
				ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.Основание.смартЗапчастиГарантийные;
			КонецЕсли;
		КонецЕсли;
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда   
		
		#Удаление //++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования 
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
		#КонецУдаления //-- #1901 смарт: Ермаков 21.08.2024

		#Вставка
		//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		//Каратеев + 
		//Кусок кода для работы процедуры формирования документа заказа из отчета планирование закупок
		Если ДанныеЗаполнения.Свойство("ТоварыКЗаказу") Тогда
			смартЗаполнитьДокументНаОснованииОтчета(ДанныеЗаполнения);
		Иначе
			ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);//Эта строка из типовой конфигурации
		КонецЕсли;
		//Каратеев -
		//-- смарт:ММ 27.03.2020
		//-- #1670 смарт: Мосолов 14.03.2024
		#КонецВставки 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ЗаполнитьПоЗаявкеНаВозвратТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		ЗаполнитьПоЗаказуНаВнутреннееПотребление(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ЗаполнитьПоЗаказуНаСборку(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда
		ЗаполнитьПоПоступлениюТоваров(ДанныеЗаполнения); 
		
	#Вставка
	//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		ДокументОснование = ДанныеЗаполнения; 
		Организация = ДанныеЗаполнения.Организация;
	//-- #Б-1136 смарт: Мосолов 15.10.2024 
	//++ #Б3700 смарт: Шляпников 22.07.2025 / Заявка на разборку оборудования. Дополнения. Версия 2.
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования") Тогда
		ДокументОснование = ДанныеЗаполнения; 
		Организация = ДанныеЗаполнения.Организация;
	//-- #Б3700 смарт: Шляпников 22.07.2025
	#КонецВставки
		
	КонецЕсли;
	
	ЕстьВариантОбеспечения = ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Товары")
			И ТипЗнч(ДанныеЗаполнения.Товары) = Тип("ТаблицаЗначений")
			И ДанныеЗаполнения.Товары.Колонки.Найти("ВариантОбеспечения") <> Неопределено;
			
	#Вставка 
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;	
	//-- #1989 смарт: Лопато 15.08.2024
	#КонецВставки 
	
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения));
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
			ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.смартЗапчастиГарантийные;
		КонецЕсли;
	КонецЕсли;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	
	ИнициализироватьДокумент(ДанныеЗаполнения, Не ЕстьВариантОбеспечения);
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры //-- #1670 смарт: Мосолов 14.03.2024

//++ смарт:ММ #044 224 12.01.2021 - Заявка на гарантийный ремонт 
&После("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.СкладПолучатель = Справочники.смартПредопределенныеЗначения.СкладГарантийныхЗапчастейПоУмолчанию.Значение Тогда
		СкладПолучатель = Неопределено;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 12.01.2021

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;

	#Вставка
	//++ #Б1992 смарт: Шляпников 31.01.2025 / Заказ на перемещение. Демозал.
	СкладДемозалМоскваСмарт = Справочники.смартПредопределенныеЗначения.Настройки.СкладДемозалМоскваСмарт;
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава, смартИнженерДемозала, АдминистраторДемоЗала, смартМнеджерДемозала") 
	     И (СкладОтправитель = СкладДемозалМоскваСмарт
	   	    ИЛИ СкладПолучатель = СкладДемозалМоскваСмарт
		 	ИЛИ Ссылка.СкладОтправитель = СкладДемозалМоскваСмарт
	   	    ИЛИ Ссылка.СкладПолучатель = СкладДемозалМоскваСмарт) Тогда
		   
		ОбщегоНазначения.СообщитьПользователю("У вас нет прав на перемещение товаров по демо залу Москва !",,,, Отказ);
		Возврат;
		
	КонецЕсли;
	//-- #Б1992 смарт: Шляпников 31.01.2025
	#КонецВставки

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Не ИспользоватьДлительностьПеремещения Тогда
		Товары.ЗагрузитьКолонку(Товары.ВыгрузитьКолонку("НачалоОтгрузки"), "ОкончаниеПоступления");
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(
		ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(
			ЭтотОбъект,
			Документы.ЗаказНаПеремещение));
	
	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.ЗаказНаПеремещение.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ХозяйственнаяОперация,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	ШаблонНазначения = Документы.ЗаказНаПеремещение.ШаблонНазначения(ЭтотОбъект);
	ПерегенерацияНазначения = Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения,
		ЭтотОбъект, "НаправлениеДеятельности", Отказ);
	
	Если ПерегенерацияНазначения Тогда
		ОбосабливатьПоНазначениюЗаказа = Константы.ВариантОбособленияТоваровВПеремещении.Получить()
			<> Перечисления.ВариантыОбособленияТоваровВПеремещении.НазначениеПолучателя;
	КонецЕсли;
	
	#Вставка 
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	
	//++ смарт:КМД #2_4 327 28.12.2020
	//перенесено из предыдущей разработки
	//++ смарт:ММ #059 327 02.08.2020 - Перенос даты резерва, спр. Грузы 
	
	//проверка на новый документ и на факт проведения
	Если ЗначениеЗаполнено(Ссылка) И РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		// Проверка, изменились ли даты поступления в табличной части
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаПеремещениеТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаПеремещениеТовары.ОкончаниеПоступления КАК ДатаПоступления,
		|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
		|	ЗаказНаПеремещениеТовары.Количество КАК Количество,
		|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель КАК Склад
		|ПОМЕСТИТЬ ВТ_ДанныеПоСсылке
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		|ГДЕ
		|	ЗаказНаПеремещениеТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПеремещениеТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаПеремещениеТовары.ОкончаниеПоступления КАК ДатаПоступления,
		|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
		|	ЗаказНаПеремещениеТовары.Количество КАК Количество,
		|	&СкладПолучатель КАК Склад
		|ПОМЕСТИТЬ ВТ_ДанныеОбъекта
		|ИЗ
		|	&Товары КАК ЗаказНаПеремещениеТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеПоСсылке.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеОбъекта.Характеристика КАК Характеристика,
		|	ВТ_ДанныеОбъекта.ДатаПоступления КАК ДатаПоступления,
		|	ВТ_ДанныеОбъекта.Количество КАК Количество,
		|	ВТ_ДанныеОбъекта.Склад КАК Склад,
		|	ВТ_ДанныеПоСсылке.ДатаПоступления КАК ДатаПоступленияНачальная
		|ИЗ
		|	ВТ_ДанныеПоСсылке КАК ВТ_ДанныеПоСсылке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОбъекта КАК ВТ_ДанныеОбъекта
		|		ПО ВТ_ДанныеПоСсылке.НомерСтроки = ВТ_ДанныеОбъекта.НомерСтроки
		|			И ВТ_ДанныеПоСсылке.Номенклатура = ВТ_ДанныеОбъекта.Номенклатура
		|			И ВТ_ДанныеПоСсылке.Характеристика = ВТ_ДанныеОбъекта.Характеристика
		|			И ВТ_ДанныеПоСсылке.ДатаПоступления <> ВТ_ДанныеОбъекта.ДатаПоступления
		|			И ВТ_ДанныеПоСсылке.Склад = ВТ_ДанныеОбъекта.Склад";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
		Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ДополнительныеСвойства.Вставить("смартИзмениласьДатаПоступленияДокумента", Истина);
			ТаблицаИзменившихсяДатПоступления = РезультатЗапроса.Выгрузить();
			ДополнительныеСвойства.Вставить("смартТаблицаИзменившихсяДатПоступления", ТаблицаИзменившихсяДатПоступления);
		КонецЕсли;				
		
	КонецЕсли;
	
	//++ смарт:КМД #2_4 327 24.12.2020
	//сбор таблицы для проверки отрицательных остатков
	Если ДополнительныеСвойства.Свойство("смартНеПроверятьДоступныеОстаткиПланируемыхПоступлений") = Ложь тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
		               |	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
		               |	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель КАК Склад
		               |ИЗ
		               |	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		               |ГДЕ
		               |	ЗаказНаПеремещениеТовары.Ссылка = &Ссылка
		               //++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
					   |	И ЗаказНаПеремещениеТовары.ВариантОбеспечения В(&ВариантыОбеспечения)
		               //-- #1333 смарт: Фролов 27.03.2023
					   |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
		               |	ЗаказНаПеремещениеТовары.Номенклатура,
		               |	ЗаказНаПеремещениеТовары.Характеристика";
		//++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		ВариантыОбеспечения=Новый Массив;
		ВариантыОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада); 
		ВариантыОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);
		Запрос.УстановитьПараметр("ВариантыОбеспечения",ВариантыОбеспечения); 
		//-- #1333 смарт: Фролов 27.03.2023
		
		ТаблицаДляПроверкиОтрицательныхОстатков = Запрос.Выполнить().Выгрузить();
		ДополнительныеСвойства.Вставить("смартТаблицаДляПроверкиОтрицательныхОстатков", ТаблицаДляПроверкиОтрицательныхОстатков);
		
		//++ смарт:КМД #2_4 327 28.12.2020
		//сбор таблицы для проверки отрицательных остатков по складу отправителю
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
		               |	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
		               |	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель КАК Склад
		               |ИЗ
		               |	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		               |ГДЕ
		               |	ЗаказНаПеремещениеТовары.Ссылка = &Ссылка 
		               //++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
					   |	И ЗаказНаПеремещениеТовары.ВариантОбеспечения В(&ВариантыОбеспечения)
		               //-- #1333 смарт: Фролов 28.03.2023
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
		               |	ЗаказНаПеремещениеТовары.Номенклатура,
		               |	ЗаказНаПеремещениеТовары.Характеристика";  
		//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		ВариантыОбеспечения=Новый Массив;
		ВариантыОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада); 
		ВариантыОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);
		Запрос.УстановитьПараметр("ВариантыОбеспечения",ВариантыОбеспечения); 
		//-- #1333 смарт: Фролов 28.03.2023
		
		ТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель = Запрос.Выполнить().Выгрузить();
		ДополнительныеСвойства.Вставить("смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель", ТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель);
		
	КонецЕсли;
	//-- смарт:КМД #2_4 327 24.12.2020
    
    //++ смарт:Подкин #896 11.02.2022 10:29:44    
    Если (НЕ ЭтотОбъект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз")) 
        И 
        Не ЗначениеЗаполнено(ЭтотОбъект.ЗонаДоставки) Тогда 
        ЗД = Справочники.смартПредопределенныеЗначения.ЗонаДоставкиМоскваМО;
        Если ЗначениеЗаполнено(ЗД.значение) Тогда
            ЭтотОбъект.ЗонаДоставки = ЗД.значение; 
        КонецЕсли;
    КонецЕсли;
    //-- смарт:Подкин #896 11.02.2022 10:29:44

	//-- смарт:КМД #2_4 327 28.12.2020
	
	//-- #1670 смарт: Мосолов 14.03.2024  
	#КонецВставки
	
КонецПроцедуры //-- #1670 смарт: Мосолов 14.03.2024

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ЗаказНаПеремещение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗаказыСервер.ОтразитьЗаказыНаПеремещение(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьГрафикОтгрузкиТоваров(ДополнительныеСвойства, Движения, Отказ);  
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	//++ смарт 688 Корнющенко 21.10.21
	смарт_ОбработатьГрафик(Движения,Отказ);
	//-- смарт 688 Корнющенко 21.10.21  
	//-- #1670 смарт: Мосолов 14.03.2024
	
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартСборкаРазборкаОборудованияСервер.ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки 
	
	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);

	СформироватьСписокРегистровДляКонтроля();

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ,, Ссылка);
	КонецЕсли;
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
    //перенос из &После
	
	//++ смарт:КМД #2_4 327 28.12.2020
	//проверка отрицательных остатков по складу отправителя выполняется в любом случае
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель") тогда
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//+- смарт:Каратеев 16.06.2022 
		//Закомментировал строку ниже, так как при проведении формируются не корректные записи в регистре ДоступныеОстаткиПланируемыхПоступлений.
		//Из-за этого при проведении документа ругается на отрицательные остатки, даже если товар фактически есть в наличии.
		//На момент проведения документа, в регистре нет ни одной записи по товару, следовательно где то до этой проверки происходит формирование записи в регистр.
		//Прежде чем раскомментировать строку, необходимо найти процедуру формирования записи и поправить ее.
		//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель, Отказ, Истина);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("смартИзмениласьДатаПоступленияДокумента")
		И ДополнительныеСвойства.смартИзмениласьДатаПоступленияДокумента = Истина Тогда
		
		смарт_ПеренестиДатыПлановойОтгрузкиВЗаказахКлиента();
		//++ смарт:КМД #2_4 327 24.12.2020
		//проверка на отрицательные остатки по регистру ДоступныеОстаткиПланируемыхПоступлений, если в документе не менялись даты поступлений
		//если менялись дату поступлений, то в регистре будут отрицательные остаткии, проверка не имеет смысла
		//еще учитываем что плановые даты поступлений двигаются приоритетно через справочник грузы, значит остальные реквизиты при этом измениться не могут
		//тут 2 вариант реализации:
		//1. инициировать проверку на отрицательные остатки только когда документы не двигаются (если документы сдвинули, а проведение заказа поставщику отменили, то и документы не надо было сдвигать, иначе вообще будут некоректные данные в регистрах)
		//2. Изменять связанные документы в транзации, после изменения проверять на отрицательные остатки и при ошибке отменять транзакцию. НО! Если связанные документ не перепроведется, то надо и не проводить заказ поставщику, что не правильно
	Иначе
		Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда
			//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
			//++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
			//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ, Истина); 
			смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,Истина);
			//-- #1333 смарт: Фролов 27.03.2023
		КонецЕсли;
		
        //-- смарт:КМД #2_4 327 24.12.2020
    КонецЕсли;
    //-- смарт:КМД #2_4 327 28.12.2020
    
 	//-- #1670 смарт: Мосолов 14.03.2024
	#КонецВставки 

КонецПроцедуры //-- #1670 смарт: Мосолов 14.03.2024

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	
	//++ смарт:КМД #2_4 327 28.12.2020
	//проверка по складу получателю
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ);
		смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ);
		//-- #1333 смарт: Фролов 27.03.2023
	КонецЕсли;
	
	//проверка по складу отправителю
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель") тогда
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		//смарт_ПроверкаНаОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель, Отказ); 
		смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатковСкладОтправитель,Отказ);
		//-- #1333 смарт: Фролов 27.03.2023
	КонецЕсли;
	//-- смарт:КМД #2_4 327 28.12.2020
	
	//-- #1670 смарт: Мосолов 14.03.2024  
	
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ, Истина, Ссылка);
	КонецЕсли;
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки   
	
КонецПроцедуры //-- #1670 смарт: Мосолов 14.03.2024

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	Массив.Добавить(Движения.ОбеспечениеЗаказов);

	// Контроль выполняется при перепроведении и отмене проведения.
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Массив.Добавить(Движения.ЗаказыНаПеремещение);
	КонецЕсли;

	Если Не ДополнительныеСвойства.ЭтоНовый
		Или НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаПеремещение).ИспользоватьСерииНоменклатуры Тогда
		Массив.Добавить(Движения.ТоварыКОтгрузке);
	КонецЕсли;

	// Контроль выполняется только при проведении.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Массив.Добавить(Движения.СвободныеОстатки);
		Массив.Добавить(Движения.ГрафикОтгрузкиТоваров);

	КонецЕсли;
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Массив.Добавить(Движения.смартОборудованиеКРазборке);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_ПеренестиДатыПлановойОтгрузкиВЗаказахКлиента()
	ТаблицаИзменившихсяДатПоступления = Неопределено;
	Если ДополнительныеСвойства.Свойство("смартТаблицаИзменившихсяДатПоступления", ТаблицаИзменившихсяДатПоступления) И
		ЗначениеЗаполнено(ТаблицаИзменившихсяДатПоступления) тогда
		
		МассивТиповДокументов = смарт_ПолучитьМассивТиповСдвинутьДокументы();
		
		Для каждого стр из ТаблицаИзменившихсяДатПоступления цикл
			//проверка наличия отрицательных остатков в регистре сведений ДоступныеОстаткиПланируемыхПоступлений
			
			//дата поступления сдвинулась вперед, возможно образовался отрицательный остаток
			Если стр.ДатаПоступления > стр.ДатаПоступленияНачальная тогда
				ОтрицательныйОстаток = смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(стр.Номенклатура, стр.Характеристика, стр.Склад);
				
				Если ОтрицательныйОстаток < 0 тогда
					смарт_СдвинутьДокументыОтгрузки(стр.Номенклатура, стр.Характеристика, стр.Склад, МассивТиповДокументов, Истина, Ложь);
				КонецЕсли;
			//дата поступления сдвинулась вперед, отрицательный остаток не образовывается, но необходимо даты связанные документов тоже сдвинуть назад
			ИначеЕсли стр.ДатаПоступления < стр.ДатаПоступленияНачальная тогда
				смарт_СдвинутьДокументыОтгрузки(стр.Номенклатура, стр.Характеристика, стр.Склад, МассивТиповДокументов, Истина, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_ПолучитьМассивТиповСдвинутьДокументы()
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаСборку"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	
	Возврат Массив;
КонецФункции
                       
//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(Номенклатура, Характеристика, Склад)
	ОтрицательныйОстаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ДоступныеОстаткиПланируемыхПоступлений.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ДоступныеОстаткиПланируемыхПоступлений
	|ГДЕ
	|	ДоступныеОстаткиПланируемыхПоступлений.Номенклатура = &Номенклатура
	|	И ДоступныеОстаткиПланируемыхПоступлений.Характеристика = &Характеристика
	|	И ДоступныеОстаткиПланируемыхПоступлений.Склад = &Склад
	|	И ДоступныеОстаткиПланируемыхПоступлений.Количество < 0
	|	И ДоступныеОстаткиПланируемыхПоступлений.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.Количество) тогда
			ОтрицательныйОстаток = Выборка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтрицательныйОстаток;

КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Функция смарт_ТекстЗапросаГрафики()
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПоступленияТоваровОбороты.ДатаСобытия КАК ДатаСобытия,
	|	ГрафикПоступленияТоваровОбороты.КоличествоИзЗаказовПриход КАК КоличествоПоступление
	|ИЗ
	|	РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|			,
	|			,
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ГрафикПоступленияТоваровОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОтгрузкиТоваровОбороты.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход КАК КоличествоОтгрузка,
	|	ГрафикОтгрузкиТоваровОбороты.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад) КАК ГрафикОтгрузкиТоваровОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки
	|";

	
	Возврат Текст;

КонецФункции

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, Склад, МассивТиповДокументов, СдвигатьРекурсивноЗаказыНаПеремещение, СдвигатьНазад)

	//найдем таблица по графикам отгрузки и поступления
	//распланируем даты отгрузки в зависимости от дат поступления
	
	Запрос = Новый Запрос;
	Запрос.Текст = смарт_ТекстЗапросаГрафики();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТЗГрафикПоступления = МассивРезультатов[0].Выгрузить();
	ТЗГрафикОтгрузки = МассивРезультатов[1].Выгрузить();
	
	ТЗГрафикОтгрузки.Колонки.Добавить("ДатаСдвига", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	//для каждого документа из ТЗГрафикОтгрузки найдем даты, на которые надо перенести документ для того, чтобы график был корректным
	//разбивка строк в документах графика отгрузки не предусмотрена согласно условиям задачи!
	Для каждого стр_отгрузка из ТЗГрафикОтгрузки цикл
		КоличествоОтгрузка = стр_отгрузка.КоличествоОтгрузка;
		ДатаОтгрузки = стр_отгрузка.ДатаОтгрузки;
		
		//найдем соответсвующую строку графика поступления
		КоличествоГрафикПриемки = 0; //для поиска строк
		
		ДатаСдвига = Дата("00010101000000");
		
		Для каждого стр_поступление из ТЗГрафикПоступления цикл
			КоличествоГрафикПриемки = КоличествоГрафикПриемки + стр_поступление.КоличествоПоступление;
			Если КоличествоОтгрузка <= КоличествоГрафикПриемки тогда
				ДатаСдвига = стр_поступление.ДатаСобытия;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//обработка таблицы ТЗГрафикПоступления, удаляем уже "занятые" количества
		МассивСтрокУдалить = Новый Массив;
		ОсталосьРаспределить = КоличествоОтгрузка;
		Для каждого стр_поступление из ТЗГрафикПоступления цикл
			Если ОсталосьРаспределить <= 0 тогда
				Прервать;
			КонецЕсли;
			
			РаспределитьТекущаяИтерация = Мин(стр_поступление.КоличествоПоступление, ОсталосьРаспределить);
			
			стр_поступление.КоличествоПоступление = стр_поступление.КоличествоПоступление - РаспределитьТекущаяИтерация;
			ОсталосьРаспределить = ОсталосьРаспределить - РаспределитьТекущаяИтерация;
			
			Если стр_поступление.КоличествоПоступление = 0 тогда
				МассивСтрокУдалить.Добавить(стр_поступление);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСтрокУдалить.Количество() > 0 тогда
			Для каждого стр_удалить из МассивСтрокУдалить цикл
				ТЗГрафикПоступления.Удалить(стр_удалить);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаСдвига) тогда
			//нашли дату сдвига
			Если СдвигатьНазад = Истина тогда
				Если НачалоДня(ДатаСдвига) < НачалоДня(ДатаОтгрузки) тогда
					//в этом случае надо сдвигать дату в документе отгрузки
					стр_отгрузка.ДатаСдвига = ДатаСдвига;
				КонецЕсли;
			Иначе
				Если НачалоДня(ДатаСдвига) > НачалоДня(ДатаОтгрузки) тогда
					//в этом случае надо сдвигать дату в документе отгрузки
					стр_отгрузка.ДатаСдвига = ДатаСдвига;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//по наличию дат сдвигов сдвигаем документы
	//поддерживается сдвиг следующий документов:
	//1. ЗаказКлиента
	//2. ЗаказНаПеремещение
	//3. ЗаказНаСборку
	//4. ЗаказНаВнутреннееПотребление
	
	МассивИзмененныхЗаказовНаПеремещение = Новый Массив;
	
	Для каждого стр_отгрузка из ТЗГрафикОтгрузки цикл
		Если ЗначениеЗаполнено(стр_отгрузка.ДатаСдвига) тогда
			смарт_СдвинутьДокументИзменениеДокумента(МассивТиповДокументов, стр_отгрузка.Документ, стр_отгрузка.ДатаСдвига, Номенклатура, Характеристика, Склад, МассивИзмененныхЗаказовНаПеремещение);
		КонецЕсли;
	КонецЦикла;
	
	//рекурсивно сдвигаем даты "подчиненных" документов по складам получателям в заказах на перемещение
	//глубина вложенности - 1, то есть если будет несколько перемещений (Склад 1 - Склад 2 - Склад 3 - Заказ клипента склад 3), то заказ клиента исправлен не будет
	Если СдвигатьРекурсивноЗаказыНаПеремещение = Истина тогда
		Для каждого ЗаказНаПеремещение из МассивИзмененныхЗаказовНаПеремещение цикл
			СкладПеремещение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказНаПеремещение, "СкладПолучатель");
			Если ЗначениеЗаполнено(СкладПеремещение) тогда
				Если СдвигатьНазад = Истина тогда
					смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, СкладПеремещение, МассивТиповДокументов, Ложь, СдвигатьНазад);
				Иначе
					ОтрицательныйОстаток = смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(Номенклатура, Характеристика, СкладПеремещение);
					Если ОтрицательныйОстаток < 0 тогда
						смарт_СдвинутьДокументыОтгрузки(Номенклатура, Характеристика, СкладПеремещение, МассивТиповДокументов, Ложь, СдвигатьНазад);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Процедура смарт_СдвинутьДокументИзменениеДокумента(МассивТиповДокументов, Док, ДатаСдвига, Номенклатура, Характеристика, Склад, МассивИзмененныхЗаказовНаПеремещение)
	ТипДок = ТипЗнч(Док);
	
	Если МассивТиповДокументов.Найти(ТипДок) <> Неопределено тогда
		//меняем данные в документах и проводим
		Об = Док.ПолучитьОбъект();
		
		Попытка
			Об.Заблокировать();
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Строка(Док) + " не возможно изменить, он заблокирован: " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		ОбъектИзменен = Ложь;
		
		Если ТипДок = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ
			ТипДок = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") тогда
			//отгрузить одной датой
			Если Об.НеОтгружатьЧастями = Истина тогда
				//если заказ отгружается одной датой, то снимаем этот признак, для того чтобы подвинуть дату по конкретному товару
				Об.НеОтгружатьЧастями = Ложь;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Номенклатура);
			Отбор.Вставить("Характеристика", Характеристика);
			Если ТипДок = Тип("ДокументСсылка.ЗаказКлиента") тогда
				Отбор.Вставить("Склад", Склад);
			КонецЕсли;
			Отбор.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов")); //резервировать к дате
			
			МассивСтрок = Об.Товары.НайтиСтроки(Отбор);
			Для каждого стр из МассивСтрок цикл
				стр.ДатаОтгрузки = ДатаСдвига;
				ОбъектИзменен = Истина;
			КонецЦикла;
		ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказНаСборку") тогда
			Об.НачалоСборкиРазборки = ДатаСдвига;
			Об.ОкончаниеСборкиРазборки = ДатаСдвига;
				
			ОбъектИзменен = Истина;
		ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказНаПеремещение") тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Номенклатура);
			Отбор.Вставить("Характеристика", Характеристика);
			Отбор.Вставить("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов")); //резервировать к дате
			
			МассивСтрок = Об.Товары.НайтиСтроки(Отбор);
			Для каждого стр из МассивСтрок цикл
				стр.НачалоОтгрузки = ДатаСдвига;
				ОбъектИзменен = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если ОбъектИзменен Тогда
			//++ КМД 01.02.2021
			//добавим доп. свойство для отмены проверки на отрицательные остатки по регистру ДоступныеОстаткиПланируемыхПоступлений
			Об.ДополнительныеСвойства.Вставить("смартНеПроверятьДоступныеОстаткиПланируемыхПоступлений", Истина);
			
			Попытка
				Об.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменены даты резерва в документе """ + Строка(Док) + """", Док);
				
				НомерПоследнейВерсии = ПолучитьНомерВерсииПоследний(Док);
				Если НомерПоследнейВерсии <> Неопределено Тогда
					ВерсионированиеОбъектов.ДобавитьКомментарийКВерсии(Док, НомерПоследнейВерсии, "Автоматический перенос резерва при изменении даты поступления товара");
				КонецЕсли;
				
				Если ТипДок = Тип("ДокументСсылка.ЗаказНаПеремещение") тогда
					МассивИзмененныхЗаказовНаПеремещение.Добавить(Док);
				КонецЕсли;
			Исключение				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ """ + Строка(Док) + """ не записан: " + ОписаниеОшибки());
				//Отказ = Истина;
				//ОтменитьТранзакцию();
				//Возврат;
			КонецПопытки;	
		КонецЕсли;
		
		Об.Разблокировать();
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД #2_4 327 28.12.2020
Функция ПолучитьНомерВерсииПоследний(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Максимум(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВерсииОбъектов.Объект";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НомерВерсии;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 05.10.2020

//++ #1333 смарт: Фролов 27.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
Функция смартПроверитьВозникновениеОтрицательныхОстатков(смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,ПриПроведении=Ложь)
	Запрос=Новый Запрос;	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ВходящиеДанные.Номенклатура КАК Номенклатура,
	|			ВходящиеДанные.Характеристика КАК Характеристика,
	|			ВходящиеДанные.Склад КАК Склад,
	|			ВходящиеДанные.Количество КАК Количество
	|		ПОМЕСТИТЬ ВТТовары
	|		ИЗ
	|			&ВТДанные КАК ВходящиеДанные
	|		;
    |
	|		////////////////////////////////////////////////////////////////////////////////
	|		ВЫБРАТЬ
	|			Набор.Номенклатура КАК Номенклатура,
	|			Набор.Характеристика КАК Характеристика,
	|			Набор.Склад КАК Склад,
	|			СУММА(Набор.Количество) КАК Количество
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГрафикПоступленияТоваровОбороты.Номенклатура КАК Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика КАК Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад КАК Склад,
	|				СУММА(ГрафикПоступленияТоваровОбороты.КоличествоИзЗаказовПриход) КАК Количество
	|			ИЗ
	|				РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикПоступленияТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикПоступленияТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикПоступленияТоваровОбороты.Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				СУММА(-1 * ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход)
	|			ИЗ
	|				РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикОтгрузкиТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикОтгрузкиТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Характеристика,
	|				ВТТовары.Склад,
	|				СУММА(ВТТовары.Количество)
	|			ИЗ
	|				ВТТовары КАК ВТТовары
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Склад,
	|				ВТТовары.Характеристика) КАК Набор
    |
	|		СГРУППИРОВАТЬ ПО
	|			Набор.Номенклатура,
	|			Набор.Характеристика,
	|			Набор.Склад
	|		ИМЕЮЩИЕ
	|		СУММА(Набор.Количество) < 0";
	Запрос.УстановитьПараметр("Регистратор",Этотобъект.Ссылка);

	смартТаблицаДляПроверкиОтрицательныхОстатков.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	Для Каждого Стр Из смартТаблицаДляПроверкиОтрицательныхОстатков Цикл 
		Количество=0;
		Если ПриПроведении Тогда
			СтрокиТовары=ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));	
			Для Каждого СтрТовары Из СтрокиТовары Цикл
				Если СтрТовары.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.СоСклада 
					ИЛИ СтрТовары.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.ИзЗаказов
					ИЛИ СтрТовары.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.Отгрузить Тогда
					Если НЕ СтрТовары.Отменено Тогда
						Количество=Количество+СтрТовары.Количество;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		Стр.Количество=Количество;				
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("ВТДанные",смартТаблицаДляПроверкиОтрицательныхОстатков);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда
		Отказ = Истина;
		Если ПриПроведении тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки: ");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки при отмене проведения / пометке на удаление документа: ");
		КонецЕсли;
		
		Для Каждого Стр Из Рез Цикл
			ТекстОшибки = "По номенклатуре """ + Строка(Стр.Номенклатура) + """";
			Если ЗначениеЗаполнено(Стр.Характеристика) тогда
				ТекстОшибки = ТекстОшибки + "(" + Строка(Стр.Характеристика) + ")";
			КонецЕсли;
			
			ТекстОшибки = ТекстОшибки + " возникает отрицательный остаток " + Формат(Стр.Количество ) + " " + Строка(Стр.Номенклатура.ЕдиницаИзмерения) + " по складу """ + Строка(Стр.Склад) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;	
	КонецЕсли;	
КонецФункции //-- #1333 смарт: Фролов 27.03.2023 

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//Каратеев +
//Кусок кода для работы процедуры формирования документа заказа из отчета планирование закупок
Процедура смартЗаполнитьДокументНаОснованииОтчета(ДанныеЗаполнения)
	
	Для Каждого Строка Из ДанныеЗаполнения.ТоварыКЗаказу Цикл
		
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), Строка);
		
	КонецЦикла;
	
	ЭтотОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("Смарт-Т ООО");
	ЭтотОбъект.СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Первый Этаж");
		
КонецПроцедуры //Каратеев - //-- #1670 смарт: Мосолов 14.03.2024

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
//++ смарт 688 Корнющенко 21.10.21
Процедура смарт_ОбработатьГрафик(Движения,Отказ)
	
	Рег=Движения.ГрафикОтгрузкиТоваров;
	Таб=Рег.Выгрузить();
	
	Для каждого Стр Из Товары Цикл
		Если НЕ (Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ИзЗаказов ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада) Тогда
			Для Каждого Стр2 ИЗ Таб Цикл
				Если Стр.Номенклатура = Стр2.Номенклатура И Стр.Характеристика = Стр2.Характеристика Тогда
					Если (Стр2.КоличествоИзЗаказов + Стр2.КоличествоНеобеспечено + Стр2.КоличествоПодЗаказ) - Стр.Количество <= 0 ИЛИ Стр2.КоличествоИзЗаказов = 0 Тогда
						Таб.Удалить(Стр2);
						Рег.Записывать=Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Рег.Загрузить(Таб);
	
КонецПроцедуры //-- смарт 688 Корнющенко 21.10.21 //-- #1670 смарт: Мосолов 14.03.2024

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
// Перенес из &Вместо
&ИзменениеИКонтроль("ЗаполнитьПоЗаказуКлиента")
Процедура смарт_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказКлиента.Статус                  КАК СтатусДокумента,
	|	ЗаказКлиента.Проведен                КАК Проведен,
	|	ЗаказКлиента.Организация             КАК Организация,
	|	ВЫБОР КОГДА ЗаказКлиента.Сделка.ОбособленныйУчетТоваровПоСделке ТОГДА
	|				ЗаказКлиента.Сделка
	|		КОНЕЦ                            КАК Сделка,
	|	ЗаказКлиента.Подразделение           КАК Подразделение,
	
	#Вставка  
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	
	//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать  
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.смартВидТранспорта КАК смартВидТранспорта,
	|	ЗаказКлиента.смартНомерМашины КАК смартНомерМашины,
	|	ЗаказКлиента.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиента.смартФИОВодителя КАК смартФИОВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиента.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ЗаказКлиента.смартЖелаемаяДатаОтгрузкиАдмирал КАК смартЖелаемаяДатаОтгрузкиАдмирал,
	|	ЗаказКлиента.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя,
	//-- #1228 смарт: Фролов 25.11.2022   
	
	//-- #1670 смарт: Мосолов 14.03.2024  
	#КонецВставки
	
	|	ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
		ЗаказКлиента,
		Реквизиты.СтатусДокумента,
		НЕ Реквизиты.Проведен);
	
	// Заполнение шапки
	Организация             = Реквизиты.Организация;
	Сделка                  = Реквизиты.Сделка;
	ДокументОснование       = ЗаказКлиента;
	Подразделение           = Реквизиты.Подразделение;
	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности; 
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	
	//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать  
	смартВидТранспорта 						= Реквизиты.смартВидТранспорта;
	смартНомерМашины 						= Реквизиты.смартНомерМашины;
	смартНомерПрицепа 						= Реквизиты.смартНомерПрицепа;
	смартФИОВодителя 						= Реквизиты.смартФИОВодителя;
	смартНомерСерияПаспортВодителя 			= Реквизиты.смартНомерСерияПаспортВодителя;
	смартДатаВыдачиПаспортаВодителя 		= Реквизиты.смартДатаВыдачиПаспортаВодителя;
	смартЖелаемоеВремяОтгрузки 				= Реквизиты.смартЖелаемоеВремяОтгрузки;
	смартЖелаемаяДатаОтгрузкиАдмирал 		= Реквизиты.смартЖелаемаяДатаОтгрузкиАдмирал;
	смартФИОВторогоВодителя 				= Реквизиты.смартФИОВторогоВодителя;
	смартНомерСерияПаспортВторогоВодителя 	= Реквизиты.смартНомерСерияПаспортВторогоВодителя;
	смартДатаВыдачиПаспортаВторогоВодителя 	= Реквизиты.смартДатаВыдачиПаспортаВторогоВодителя;
	//-- #1228 смарт: Фролов 25.11.2022   
	
	//-- #1670 смарт: Мосолов 14.03.2024  
	#КонецВставки   
	
	СкладПолучатель         = ДанныеЗаполнения.Склад;
	
	// Заполнение табличной части.
	
	ПараметрыТаблицыТовары = ОбеспечениеСервер.ПараметрыТаблицыОстатковПоЗаказу();
	ПараметрыТаблицыТовары.ПолучатьУслуги = Ложь;
	ПараметрыТаблицыТовары.ПолучатьРаботы = Ложь;
	ПараметрыТаблицыТовары.Отбор          = СкладПолучатель;
	
	ТаблицаТовары = ОбеспечениеСервер.ТаблицаОстатковКЗаказу(ЗаказКлиента, ПараметрыТаблицыТовары);
	Товары.Загрузить(ТаблицаТовары);
	
КонецПроцедуры //-- #1670 смарт: Мосолов 14.03.2024

#КонецОбласти 

#КонецЕсли
